{
  "navbar": {
    "resume": "Resume",
    "contact": "Contact"
  },
  "home": {
    "title": "HELLO, I’M BOHDAN ILIENKO",
    "subtitle-1": "I'm a Full-Stack Developer",
    "subtitle-2": "with 1.5 year of work experience."
  },
  "about": {
    "title": "About me",
    "paragraph-1": "I am a meticulous and reliable professional, adept at managing multiple priorities with a positive mindset. I willingly take on additional responsibilities to contribute to team goals, and my attention to detail is complemented by strong social skills that foster effective collaboration within a development team.",
    "paragraph-2": "In my capacity as a developer, I am passionate about crafting elegant and efficient solutions to complex problems. My skill set encompasses both front-end and back-end technologies, including React, Redux, Nest.js, and expertise in microservices architecture with Kubernetes, Docker, and RabbitMQ. Throughout my career, I've successfully worked on diverse projects, ranging from simple static websites to complex enterprise-level applications.",
    "paragraph-3": "I am well-versed in a variety of development tools such as Docker, Git and ensuring seamless project execution. Constantly seeking opportunities for professional growth, I embrace new technologies and actively pursue ways to enhance my skills and knowledge. My commitment to excellence extends to optimizing performance, improving user experience, and maintaining the highest standards of code quality in every project I undertake."
  },
  "skills": {
    "title": "My skills",
    "Node.js": "Mastering the server-side with Node.js, Express.js, and MongoDB, I've created reliable REST APIs that power my projects.",
    "React": "I use React to build high-performance and dynamic user interfaces that provide the best user experience.",
    "Nest.js": "Developing scalable server systems with Nest.js, TypeORM, and PostgreSQL, I've gained experience in developing RESTful APIs for seamless integration.",
    "Docker": "Using Docker, I containerized applications, simplifying deployment and providing a consistent environment.",
    "Kubernetes": "Managing scalable and fault-tolerant applications with Kubernetes, I've deployed clusters and maintained them.",
    "RabbitMQ": "Using RabbitMQ, I've built scalable systems that provide reliable communication between microservices.",
    "PostgreSQL": "With PostgreSQL, I've created reliable databases that become a solid foundation for working with information.",
    "MongoDB": "Working with MongoDB, I've used all the advantages of NoSQL to create reliable databases."
  },
  "projects": {
    "title": "My projects",
    "skillhub": "SkillHub is an online system for creative people who want to share their creativity and learn something new about art. It was created using React, Redux, Nest.js, Docker, and PostgreSQL.",
    "pharmacy": "The Nest.js server-side API uses MS SQL and includes JWT for secure routes and role-based access. Swagger provides accurate REST API documentation. It creates checks in PDF format, provides basic sales and drug popularity statistics.",
    "ticketing": "A small microservice application that contains the logic for ordering tickets for events. It has a fault-tolerant architecture that provides reliable communication between microservices using RabbitMQ. The solution to the problems of parallelism is implemented. This project was created using Node.js, Express.js, MongoDB, Docker, Kubernetes, and NATS."
  },
  "get-in-touch": {
    "title": "Get in touch",
    "paragraph": "I'm always open to new opportunities. If you want to collaborate with me or just talk, feel free to write to me.",
    "button": "Write"
  }
}
